## Final Project Submission

Please fill out:
* Student name: TATIANA CELINE TEMBA
* Student pace: full time
* Scheduled project review date/time: 
* Instructor name: Antonny Muiko
* Blog post URL:

## PROJECT DESCRIPTION
Analyzing Box Office Success for a New Movie Studio

## Project Overview

As the entertainment industry increasingly embraces original video content, our company is eager to enter the market by establishing a new movie studio. However, with limited knowledge of film production, the studio requires strategic guidance to ensure its success. This project aims to analyze the current trends in the movie industry, focusing on identifying the types of films that perform best at the box office. The insights gained will provide actionable recommendations to help the studio make informed decisions about the genres and features to prioritize in its film production.

## Business Problem

The primary challenge is to determine the key factors that contribute to a movie's box office success. By understanding these factors, the studio can better position itself in the competitive market, choosing genres and movie elements that resonate with audiences and maximize revenue.

## Data Sources

To address this challenge, we will analyze data from several sources:

1. Box Office Mojo
2. IMDB
3. Rotten Tomatoes 
4. TheMovieDB
5. The Numbers

## Analysis Objectives

The analysis will focus on the following key questions:
1. Which genres are the most popular and profitable?
2. What are the trends in box office revenue over the years?
3. What factors contribute to a movie's success?

## Expected Outcomes and Recommendations

The findings from this analysis will lead to three key business recommendations for the new movie studio:
1. **Focus on High-Performing Genres**: Invest in genres that have shown consistent profitability and popularity among audiences.
2. **Leverage Audience Ratings and Trends**: Use insights from audience ratings and preferences to guide the creative direction and marketing strategies.
3. **Optimize Release Timing and Movie Features**: Consider optimal release times and key movie features, such as runtime and cast, to enhance the studio's appeal and market positioning.

# Importing necessary libraries

In [849]:
import pandas as pd
import numpy as np
import sqlite3
import matplotlib.pyplot as plt
import seaborn as sns

# Loading the Data

In [850]:
# Load the datasets

bom_df = pd.read_csv('zippedData/bom.movie_gross.csv.gz')

print(bom_df.head())

                                         title studio  domestic_gross  \
0                                  Toy Story 3     BV     415000000.0
1                   Alice in Wonderland (2010)     BV     334200000.0
2  Harry Potter and the Deathly Hallows Part 1     WB     296000000.0
3                                    Inception     WB     292600000.0
4                          Shrek Forever After   P/DW     238700000.0

  foreign_gross  year
0     652000000  2010
1     691300000  2010
2     664300000  2010
3     535700000  2010
4     513900000  2010

In [851]:
tmdb_df = pd.read_csv('zippedData/tmdb.movies.csv.gz')

print(tmdb_df.head())

   Unnamed: 0            genre_ids     id original_language  \
0           0      [12, 14, 10751]  12444                en
1           1  [14, 12, 16, 10751]  10191                en
2           2        [12, 28, 878]  10138                en
3           3      [16, 35, 10751]    862                en
4           4        [28, 878, 12]  27205                en

                                 original_title  popularity release_date  \
0  Harry Potter and the Deathly Hallows: Part 1      33.533   2010-11-19
1                      How to Train Your Dragon      28.734   2010-03-26
2                                    Iron Man 2      28.515   2010-05-07
3                                     Toy Story      28.005   1995-11-22
4                                     Inception      27.920   2010-07-16

                                          title  vote_average  vote_count
0  Harry Potter and the Deathly Hallows: Part 1           7.7       10788
1                      How to Train Your Dragon           7.7        7610
2                                    Iron Man 2           6.8       12368
3                                     Toy Story           7.9       10174
4                                     Inception           8.3       22186

In [852]:
tn_df = pd.read_csv('zippedData/tn.movie_budgets.csv.gz')

print(tn_df.head())

   id  release_date                                        movie  \
0   1  Dec 18, 2009                                       Avatar
1   2  May 20, 2011  Pirates of the Caribbean: On Stranger Tides
2   3   Jun 7, 2019                                 Dark Phoenix
3   4   May 1, 2015                      Avengers: Age of Ultron
4   5  Dec 15, 2017            Star Wars Ep. VIII: The Last Jedi

  production_budget domestic_gross worldwide_gross
0      $425,000,000   $760,507,625  $2,776,345,279
1      $410,600,000   $241,063,875  $1,045,663,875
2      $350,000,000    $42,762,350    $149,762,350
3      $330,600,000   $459,005,868  $1,403,013,963
4      $317,000,000   $620,181,382  $1,316,721,747

# Select relevant columns from each dataset

In [853]:
# Select relevant columns from each dataset
bom_selected = bom_df[['title', 'studio', 'domestic_gross', 'foreign_gross']]
tmdb_selected = tmdb_df[['title', 'popularity', 'vote_count', 'original_language']]
tn_selected = tn_df[['movie', 'production_budget', 'worldwide_gross', 'domestic_gross']]

# Display the first few rows of the selected DataFrames
bom_selected.head(), tn_selected.head()

(                                         title studio  domestic_gross  \
 0                                  Toy Story 3     BV     415000000.0
 1                   Alice in Wonderland (2010)     BV     334200000.0
 2  Harry Potter and the Deathly Hallows Part 1     WB     296000000.0
 3                                    Inception     WB     292600000.0
 4                          Shrek Forever After   P/DW     238700000.0

   foreign_gross
 0     652000000
 1     691300000
 2     664300000
 3     535700000
 4     513900000  ,
                                          movie production_budget  \
 0                                       Avatar      $425,000,000
 1  Pirates of the Caribbean: On Stranger Tides      $410,600,000
 2                                 Dark Phoenix      $350,000,000
 3                      Avengers: Age of Ultron      $330,600,000
 4            Star Wars Ep. VIII: The Last Jedi      $317,000,000

   worldwide_gross domestic_gross
 0  $2,776,345,279   $760,507,625
 1  $1,045,663,875   $241,063,875
 2    $149,762,350    $42,762,350
 3  $1,403,013,963   $459,005,868
 4  $1,316,721,747   $620,181,382  )

# Renaming columns for consistency
Here, we will rename the columns to allow a similarity so as to make it easier when merging the datasets after data cleaning.

In [854]:
# Renaming columns in bom and tn dataframes
bom_selected = bom_selected.rename(columns={'foreign_gross': 'worldwide_gross'})
tn_selected = tn_selected.rename(columns={'movie': 'title'})

# Display the first few rows of the selected DataFrames
bom_selected.head(), tmdb_selected.head(), tn_selected.head()

(                                         title studio  domestic_gross  \
 0                                  Toy Story 3     BV     415000000.0
 1                   Alice in Wonderland (2010)     BV     334200000.0
 2  Harry Potter and the Deathly Hallows Part 1     WB     296000000.0
 3                                    Inception     WB     292600000.0
 4                          Shrek Forever After   P/DW     238700000.0

   worldwide_gross
 0       652000000
 1       691300000
 2       664300000
 3       535700000
 4       513900000  ,
                                           title  popularity  vote_count  \
 0  Harry Potter and the Deathly Hallows: Part 1      33.533       10788
 1                      How to Train Your Dragon      28.734        7610
 2                                    Iron Man 2      28.515       12368
 3                                     Toy Story      28.005       10174
 4                                     Inception      27.920       22186

   original_language
 0                en
 1                en
 2                en
 3                en
 4                en  ,
                                          title production_budget  \
 0                                       Avatar      $425,000,000
 1  Pirates of the Caribbean: On Stranger Tides      $410,600,000
 2                                 Dark Phoenix      $350,000,000
 3                      Avengers: Age of Ultron      $330,600,000
 4            Star Wars Ep. VIII: The Last Jedi      $317,000,000

   worldwide_gross domestic_gross
 0  $2,776,345,279   $760,507,625
 1  $1,045,663,875   $241,063,875
 2    $149,762,350    $42,762,350
 3  $1,403,013,963   $459,005,868
 4  $1,316,721,747   $620,181,382  )

## CLEANING THE DATASETS

# 1. Bom dataframe

Remove all Null Values that Read as 0

In [855]:
# Replace zeros with NaN in 'domestic_gross' and 'foreign_gross' columns
bom_df['domestic_gross'] = bom_df['domestic_gross'].replace(0, pd.NA)
bom_df['foreign_gross'] = bom_df['foreign_gross'].replace(0, pd.NA)

# Drop rows with NaN values
bom_df_cleaned = bom_df.dropna(subset=['domestic_gross', 'foreign_gross'])

# Display the cleaned DataFrame
bom_df_cleaned.head()

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010

Remove Commas from Numeric Values

In [856]:
# Remove commas from 'domestic_gross' and 'foreign_gross' columns
bom_df_cleaned['domestic_gross'] = bom_df_cleaned['domestic_gross'].replace('[,]', '', regex=True)
bom_df_cleaned['foreign_gross'] = bom_df_cleaned['foreign_gross'].replace('[,]', '', regex=True)

# Display the cleaned DataFrame
bom_df_cleaned.head()

<ipython-input-856-47a3c4b7aae7>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  bom_df_cleaned['domestic_gross'] = bom_df_cleaned['domestic_gross'].replace('[,]', '', regex=True)
<ipython-input-856-47a3c4b7aae7>:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  bom_df_cleaned['foreign_gross'] = bom_df_cleaned['foreign_gross'].replace('[,]', '', regex=True)

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010

Convert Numeric Values into Shorter Float Values

In [857]:
# Convert numeric columns to shorter float values using .loc
bom_df_cleaned.loc[:, 'domestic_gross'] = bom_df_cleaned['domestic_gross'].astype(float).round(2)
bom_df_cleaned.loc[:, 'foreign_gross'] = bom_df_cleaned['foreign_gross'].astype(float).round(2)

# Display the cleaned DataFrame
bom_df_cleaned.head()

c:\Users\USER\anaconda3\envs\learn-env\lib\site-packages\pandas\core\indexing.py:1745: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  isetter(ilocs[0], value)

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000.0,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000.0,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000.0,2010
3,Inception,WB,292600000.0,535700000.0,2010
4,Shrek Forever After,P/DW,238700000.0,513900000.0,2010

# 2. TMDB dataframe

Remove Rows with Null or Zero Values

In [858]:
# Replace zeros with NaN in 'popularity' and 'vote_count' columns
tmdb_selected['popularity'] = tmdb_selected['popularity'].replace(0, pd.NA)
tmdb_selected['vote_count'] = tmdb_selected['vote_count'].replace(0, pd.NA)

# Drop rows with NaN values
tmdb_cleaned = tmdb_selected.dropna(subset=['title', 'popularity', 'vote_count', 'original_language'])

# Display the DataFrame after dropping rows with NaN values
print(tmdb_cleaned.head())

                                          title  popularity  vote_count  \
0  Harry Potter and the Deathly Hallows: Part 1      33.533       10788
1                      How to Train Your Dragon      28.734        7610
2                                    Iron Man 2      28.515       12368
3                                     Toy Story      28.005       10174
4                                     Inception      27.920       22186

  original_language
0                en
1                en
2                en
3                en
4                en

<ipython-input-858-69f57a27db67>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  tmdb_selected['popularity'] = tmdb_selected['popularity'].replace(0, pd.NA)
<ipython-input-858-69f57a27db67>:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  tmdb_selected['vote_count'] = tmdb_selected['vote_count'].replace(0, pd.NA)

Remove Commas from Numeric Values

In [859]:
# Remove commas from 'popularity' and 'vote_count' columns
tmdb_cleaned['popularity'] = tmdb_cleaned['popularity'].replace('[,]', '', regex=True)
tmdb_cleaned['vote_count'] = tmdb_cleaned['vote_count'].replace('[,]', '', regex=True)

# Display the DataFrame after removing commas
print(tmdb_cleaned.head())

                                          title  popularity  vote_count  \
0  Harry Potter and the Deathly Hallows: Part 1      33.533       10788
1                      How to Train Your Dragon      28.734        7610
2                                    Iron Man 2      28.515       12368
3                                     Toy Story      28.005       10174
4                                     Inception      27.920       22186

  original_language
0                en
1                en
2                en
3                en
4                en

Convert Numeric Values into Shorter Float Values

In [860]:
# Convert numeric columns to shorter float values
tmdb_cleaned.loc[:, 'popularity'] = tmdb_cleaned['popularity'].astype(float).round(2)
tmdb_cleaned.loc[:, 'vote_count'] = tmdb_cleaned['vote_count'].astype(float).round(2)

# Display the final cleaned DataFrame
print(tmdb_cleaned.head())

                                          title  popularity  vote_count  \
0  Harry Potter and the Deathly Hallows: Part 1       33.53     10788.0
1                      How to Train Your Dragon       28.73      7610.0
2                                    Iron Man 2       28.52     12368.0
3                                     Toy Story       28.00     10174.0
4                                     Inception       27.92     22186.0

  original_language
0                en
1                en
2                en
3                en
4                en

# 3. TN dataframe

Removing null values that read as 0

In [861]:
# Clean the 'production_budget', 'domestic_gross', and 'worldwide_gross' columns
tn_df['production_budget'] = tn_df['production_budget'].replace('[\$,]', '', regex=True).astype(float)
tn_df['domestic_gross'] = tn_df['domestic_gross'].replace('[\$,]', '', regex=True).astype(float)
tn_df['worldwide_gross'] = tn_df['worldwide_gross'].replace('[\$,]', '', regex=True).astype(float)

# Replace zeros with NaN
tn_df['production_budget'] = tn_df['production_budget'].replace(0, pd.NA)
tn_df['domestic_gross'] = tn_df['domestic_gross'].replace(0, pd.NA)
tn_df['worldwide_gross'] = tn_df['worldwide_gross'].replace(0, pd.NA)

# Drop rows with NaN values
tn_df_cleaned = tn_df.dropna(subset=['production_budget', 'domestic_gross', 'worldwide_gross'])

# Display the cleaned DataFrame
tn_df_cleaned.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,425000000.0,760507625.0,2.776345e+09
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,410600000.0,241063875.0,1.045664e+09
2,3,"Jun 7, 2019",Dark Phoenix,350000000.0,42762350.0,1.497624e+08
3,4,"May 1, 2015",Avengers: Age of Ultron,330600000.0,459005868.0,1.403014e+09
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,317000000.0,620181382.0,1.316722e+09

Removing commas from numeric values

In [862]:
# Remove commas from 'production_budget', 'domestic_gross', and 'worldwide_gross' columns
tn_df_cleaned.loc[:, 'production_budget'] = tn_df_cleaned['production_budget'].replace('[,]', '', regex=True)
tn_df_cleaned.loc[:, 'domestic_gross'] = tn_df_cleaned['domestic_gross'].replace('[,]', '', regex=True)
tn_df_cleaned.loc[:, 'worldwide_gross'] = tn_df_cleaned['worldwide_gross'].replace('[,]', '', regex=True)

# Display the cleaned DataFrame
print(tn_df_cleaned.head())

   id  release_date                                        movie  \
0   1  Dec 18, 2009                                       Avatar
1   2  May 20, 2011  Pirates of the Caribbean: On Stranger Tides
2   3   Jun 7, 2019                                 Dark Phoenix
3   4   May 1, 2015                      Avengers: Age of Ultron
4   5  Dec 15, 2017            Star Wars Ep. VIII: The Last Jedi

   production_budget  domestic_gross  worldwide_gross
0        425000000.0     760507625.0     2.776345e+09
1        410600000.0     241063875.0     1.045664e+09
2        350000000.0      42762350.0     1.497624e+08
3        330600000.0     459005868.0     1.403014e+09
4        317000000.0     620181382.0     1.316722e+09

c:\Users\USER\anaconda3\envs\learn-env\lib\site-packages\pandas\core\indexing.py:1745: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  isetter(ilocs[0], value)

Convert Numeric Values into Shorter Float Values

In [863]:
# Convert numeric columns to shorter float values using .loc
tn_df_cleaned.loc[:, 'production_budget'] = tn_df_cleaned['production_budget'].astype(float).round(2)
tn_df_cleaned.loc[:, 'domestic_gross'] = tn_df_cleaned['domestic_gross'].astype(float).round(2)
tn_df_cleaned.loc[:, 'worldwide_gross'] = tn_df_cleaned['worldwide_gross'].astype(float).round(2)

# Display the cleaned DataFrame
tn_df_cleaned.head()

c:\Users\USER\anaconda3\envs\learn-env\lib\site-packages\pandas\core\indexing.py:1745: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  isetter(ilocs[0], value)

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,425000000.0,760507625.0,2.776345e+09
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,410600000.0,241063875.0,1.045664e+09
2,3,"Jun 7, 2019",Dark Phoenix,350000000.0,42762350.0,1.497624e+08
3,4,"May 1, 2015",Avengers: Age of Ultron,330600000.0,459005868.0,1.403014e+09
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,317000000.0,620181382.0,1.316722e+09

# Merging the cleaned data

Importing necessary libraries

In [864]:
# Import necessary libraries
import sqlite3
from sqlalchemy import create_engine

# Create a SQLite database
conn = sqlite3.connect("bom.db")
cursor = conn.cursor()

# Create tables
bom_selected.to_sql('bom', conn, if_exists='replace', index=False)
tn_selected.to_sql('tn', conn, if_exists='replace', index=False)

Here, we are merging the two tables that are bom_df anf tn_df

In [865]:
# Merge the data using SQL
query = """
SELECT
    bom.title,
    bom.studio,
    bom.domestic_gross AS domestic_gross_bom,
    bom.worldwide_gross,
    tn.production_budget,
    tn.domestic_gross AS domestic_gross_tn,
    tn.worldwide_gross
FROM
    bom
JOIN
    tn
ON
    bom.title = tn.title
"""

merged_df = pd.read_sql_query(query, conn)

# Display the merged DataFrame
merged_df.head()

,title,studio,domestic_gross_bom,worldwide_gross,production_budget,domestic_gross_tn,worldwide_gross
0,Toy Story 3,BV,415000000.0,652000000,"$200,000,000","$415,004,880","$1,068,879,522"
1,Inception,WB,292600000.0,535700000,"$160,000,000","$292,576,195","$835,524,642"
2,Shrek Forever After,P/DW,238700000.0,513900000,"$165,000,000","$238,736,787","$756,244,673"
3,The Twilight Saga: Eclipse,Sum.,300500000.0,398000000,"$68,000,000","$300,531,751","$706,102,828"
4,Iron Man 2,Par.,312400000.0,311500000,"$170,000,000","$312,433,331","$621,156,389"

In [866]:
# Create a database connection (example for SQLite)
engine = create_engine('sqlite:///your_database.db')  # Replace with your database URL
conn = engine.connect()

# SQL query with the third dataset included
query = """
SELECT
    bom.title,
    bom.studio,
    bom.domestic_gross AS domestic_gross_bom,
    bom.worldwide_gross AS bom_worldwide_gross,
    tn.production_budget,
    tn.domestic_gross AS domestic_gross_tn,
    tn.worldwide_gross AS tn_worldwide_gross,
    tmdb.popularity,
    tmdb.vote_count,
    tmdb.original_language
FROM
    bom
JOIN
    tn
ON
    bom.title = tn.title
LEFT JOIN
    tmdb_df AS tmdb
ON
    bom.title = tmdb.title
"""

In [867]:
# SQL query with the third dataset included
query = """
SELECT
    bom.title,
    bom.studio,
    bom.domestic_gross AS domestic_gross_bom,
    bom.worldwide_gross AS bom_worldwide_gross,
    tn.production_budget,
    tn.domestic_gross AS domestic_gross_tn,
    tn.worldwide_gross AS tn_worldwide_gross,
    tmdb.popularity,
    tmdb.vote_count,
    tmdb.original_language
FROM
    bom
JOIN
    tn
ON
    bom.title = tn.title
JOIN
    tmdb_df AS tmdb
ON
    bom.title = tmdb.title
"""

In [868]:
print(merged_df.head())

                        title studio  domestic_gross_bom worldwide_gross  \
0                 Toy Story 3     BV         415000000.0       652000000
1                   Inception     WB         292600000.0       535700000
2         Shrek Forever After   P/DW         238700000.0       513900000
3  The Twilight Saga: Eclipse   Sum.         300500000.0       398000000
4                  Iron Man 2   Par.         312400000.0       311500000

  production_budget domestic_gross_tn worldwide_gross
0      $200,000,000      $415,004,880  $1,068,879,522
1      $160,000,000      $292,576,195    $835,524,642
2      $165,000,000      $238,736,787    $756,244,673
3       $68,000,000      $300,531,751    $706,102,828
4      $170,000,000      $312,433,331    $621,156,389

## Conclusion

This project will provide a data-driven foundation for the new movie studio, offering strategic insights into the types of films that are likely to succeed in the competitive entertainment landscape. By aligning production efforts with proven trends and audience preferences, the studio can increase its chances of creating successful and profitable content.